import styles from "@/styles/ExtendedAboutMe.module.css";
import Image from "next/image";
import VeraImg from "@/public/img/image 5.png";
import { RevealWrapper } from "next-reveal";

export default function ExtendedAboutMe() {
  return (
    <section className={styles.aboutMeWrapper}>
      <h1>О Вере и Таро</h1>
      <div>
        <RevealWrapper className="load-hidden" delay={200} duration={1000}>
          <Image src={VeraImg} alt="VeraGuda" />
          <p>
            Мое первое знакомство с картами Таро случилось в 16 лет. Меня словно
            загипнотизировали волшебные картинки в советском журнале
            «Крестьянка». За год я собрала всю коллекцию и начала гадать себе и
            подружкам. Тогда я, конечно, была ещё не готова к пониманию всей
            глубины Таро.
            <br />
            <br />
            Прошло много лет, и в какой-то день меня, как магнитом снова
            потянуло к Таро. Пять лет назад я выбрала свою первую настоящую
            рабочую колоду и прошла обучение в профессиональной школе Таро.
            <br />
            <br />
            Затем самостоятельная стажировка на сайте тарологов, долгая
            бесплатная работа с клиентами в сети, собирание ценных знаний в свою
            копилку из разных источников. Мой интерес и уважение к Таро только
            росли.
            <br />
            <br />
            Таро можно использовать по-разному. Самый распространенный способ –
            это предсказание на будущее, увидеть, что будет дальше. Большинство
            клиентов именно это и хотят узнать.
            <br />
            <br />
            Да, карты открывают будущее, но я всегда говорю, что свою судьбу мы
            строим сами и плохие прогнозы можно и нужно менять. Таро дают
            рекомендацию, где подстелить соломку, как лучше обойти опасность,
            куда свернуть на перепутье.
            <br />
            <br />Я обожаю людей, которые могут услышать совет из будущего и
            применить его. Мои постоянные клиенты как раз такие люди. Они не
            просто проживают то, что карты предсказали, а моделируют свое
            будущее так, как нужно им.
            <br />
            <br />
            Откуда берётся предвидение будущего? Не опасно ли это? Из своего
            опыта я сделала вывод, что все знания внутри нас самих. В нашем
            подсознании уже есть все ответы.
            <br />
            <br />
            Кто-то умеет видеть подсказки в своих снах, кто-то опирается на свою
            интуицию, опыт или логику. Некоторым нужна помощь, нужен проводник.
            Внимательный, знающий, опытный, с чистым сердцем и глубоким
            пониманием. Это нормально. Как не странно, но именно свою душу
            бывает сложно услышать. Я помогу.
            <br />
            <br />
            Если вы сомневаетесь, если какой-то вопрос не оставляет вас в покое,
            если невыносимо сложно сделать выбор, принять решение, то позовите
            на помощь Таро. Они помогут. Подарят уверенность, ясность, сберегут,
            успокоят, направят. Это как фонарь в тёмном лесу — сразу видны
            тропы, кочки и овраги. Попробуйте!
          </p>
        </RevealWrapper>
      </div>
    </section>
  );
}
